app/controllers/songs_controller.rb

  def edit
    if params[:artist_id]                                   #if artist_id in params, it's nested
      @song = Song.find_by(artist_id: params[:artist_id])   #@song = Song.find_by song's artist_id from params artist_id
      if @song.nil?                                         #if there are no songs with this artist_id
        redirect_to artists_path, alert: "Artist not found" #artist doesn't exist, redirect to /artists
      elsif @song.artist
        redirect_to artist_songs_path if @song.artist.songs.find_by(id: params[:id]) == nil
---
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT ?  [["artist_id", 1], ["id", 1234], ["LIMIT", 1]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]